#+TITLE: Final project: LabBook
#+AUTHOR: Lucas Nesi
#+STARTUP: overview indent
#+TAGS: noexport(n) deprecated(d)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+SEQ_TODO: TODO(t!) STARTED(s!) WAITING(w!) | DONE(d!) CANCELLED(c!) DEFERRED(f!)
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \input{code.tex}

*** Summarize values

Let's create a table with all variation values adding the source of
values and rearrange the columns order.

#+ATTR_LATEX: :options style=Code
#+begin_src R :results output :session *R* :exports both
alloc_var_all <- rbind(alloc_var_tf17_draco %>% mutate(Source = "TF17_draco"),
                       alloc_var_tf17_tupi %>% mutate(Source = "TF17_tupi"),
                       alloc_var_tf16_draco %>% mutate(Source = "TF16_draco"))

alloc_var_all %>% select(Source, A:ABCD)
#+end_src

#+RESULTS:
:       Source       A        B       C       D      AB      AC      AD      BC
: 1 TF17_draco  0.02%   83.59%   3.62%   9.36%   0.00%   0.00%   0.00%   3.13% 
: 2  TF17_tupi  0.00%   95.26%   0.13%   2.93%   0.00%   0.00%   0.00%   1.34% 
: 3 TF16_draco  0.00%   92.88%   0.27%   2.95%   0.00%   0.00%   0.00%   3.52% 
:        BD      CD     ABC     ABD     ACD     BCD    ABCD
: 1  0.15%   0.07%   0.00%   0.00%   0.00%   0.05%   0.00% 
: 2  0.10%   0.14%   0.00%   0.00%   0.00%   0.10%   0.00% 
: 3  0.23%   0.03%   0.00%   0.00%   0.00%   0.10%   0.01%


The data indicates that the factor A (scheduling) had almost none
impact on all conditions, including all combinations with it. The
factor B (use of GPU) had the most performance influence on all the
circumstances, reaching 95.26% using the TF17 on the =TUPI=
case. The C factor (block size) presented a small impact on TF17 =Draco=
case and almost none on the other two, yet its combination with B, the
BC case, presented small variations on all situations. The last
isolated factor, D, the inner block size, exhibited medium allocation
of variation on the first case and a modest on the other two. All the
additional combinations presented a minimal allocation of variance.

